fio_test_res2_write/64_128k.txt
test: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=spdk, iodepth=64
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=74215: Thu Aug 14 19:53:17 2025
  write: IOPS=21.4k, BW=2677MiB/s (2807MB/s)(26.2GiB/10005msec); 0 zone resets
    slat (nsec): min=1262, max=31941, avg=5301.09, stdev=1961.37
    clat (usec): min=45, max=9996, avg=2982.18, stdev=2310.79
     lat (usec): min=47, max=10002, avg=2987.48, stdev=2310.78
    clat percentiles (usec):
     |  1.00th=[   48],  5.00th=[   94], 10.00th=[  159], 20.00th=[  347],
     | 30.00th=[  783], 40.00th=[ 1614], 50.00th=[ 2933], 60.00th=[ 4146],
     | 70.00th=[ 5014], 80.00th=[ 5473], 90.00th=[ 5932], 95.00th=[ 6259],
     | 99.00th=[ 6915], 99.50th=[ 7177], 99.90th=[ 7570], 99.95th=[ 7832],
     | 99.99th=[ 8356]
   bw (  MiB/s): min=   15, max= 2809, per=95.29%, avg=2550.56, stdev=585.85, samples=21
   iops        : min=  126, max=22476, avg=20404.48, stdev=4686.77, samples=21
  lat (usec)   : 50=1.15%, 100=4.35%, 250=10.46%, 500=8.71%, 750=4.90%
  lat (usec)   : 1000=3.64%
  lat (msec)   : 2=10.03%, 4=15.35%, 10=41.41%
  cpu          : usr=99.97%, sys=0.02%, ctx=8, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,214247,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=2677MiB/s (2807MB/s), 2677MiB/s-2677MiB/s (2807MB/s-2807MB/s), io=26.2GiB (28.1GB), run=10005-10005msec