fio_test_res2_write/64_512b.txt
test: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk, iodepth=64
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=68421: Thu Aug 14 19:51:54 2025
  write: IOPS=221k, BW=108MiB/s (113MB/s)(1078MiB/10001msec); 0 zone resets
    slat (nsec): min=152, max=30324, avg=168.24, stdev=58.83
    clat (usec): min=3, max=3378, avg=288.98, stdev=294.35
     lat (usec): min=3, max=3378, avg=289.14, stdev=294.35
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[   10], 20.00th=[   18],
     | 30.00th=[   37], 40.00th=[   97], 50.00th=[  208], 60.00th=[  293],
     | 70.00th=[  420], 80.00th=[  578], 90.00th=[  725], 95.00th=[  832],
     | 99.00th=[ 1090], 99.50th=[ 1205], 99.90th=[ 1549], 99.95th=[ 1778],
     | 99.99th=[ 2278]
   bw (  KiB/s): min=107487, max=111859, per=100.00%, avg=110400.55, stdev=1029.00, samples=20
   iops        : min=214974, max=223718, avg=220801.20, stdev=2058.05, samples=20
  lat (usec)   : 4=0.67%, 10=10.34%, 20=10.76%, 50=11.78%, 100=6.71%
  lat (usec)   : 250=14.90%, 500=19.96%, 750=16.21%, 1000=6.99%
  lat (msec)   : 2=1.66%, 4=0.02%
  cpu          : usr=99.97%, sys=0.02%, ctx=4, majf=0, minf=2
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,2208012,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=108MiB/s (113MB/s), 108MiB/s-108MiB/s (113MB/s-113MB/s), io=1078MiB (1131MB), run=10001-10001msec