fio_test_res2_write/64_512k.txt
test: (g=0): rw=randwrite, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=spdk, iodepth=64
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=75186: Thu Aug 14 19:53:31 2025
  write: IOPS=5427, BW=2714MiB/s (2846MB/s)(26.5GiB/10011msec); 0 zone resets
    slat (usec): min=13, max=175, avg=40.76, stdev= 7.16
    clat (usec): min=2543, max=21544, avg=11745.69, stdev=849.66
     lat (usec): min=2563, max=21586, avg=11786.45, stdev=849.59
    clat percentiles (usec):
     |  1.00th=[10421],  5.00th=[10683], 10.00th=[10945], 20.00th=[11076],
     | 30.00th=[11207], 40.00th=[11469], 50.00th=[11600], 60.00th=[11731],
     | 70.00th=[11994], 80.00th=[12387], 90.00th=[12911], 95.00th=[13435],
     | 99.00th=[14222], 99.50th=[14484], 99.90th=[15008], 99.95th=[16909],
     | 99.99th=[20579]
   bw (  MiB/s): min=   63, max= 2822, per=95.34%, avg=2587.48, stdev=583.50, samples=21
   iops        : min=  126, max= 5644, avg=5174.95, stdev=1167.00, samples=21
  lat (msec)   : 4=0.02%, 10=0.15%, 20=99.80%, 50=0.02%
  cpu          : usr=99.97%, sys=0.01%, ctx=57, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,54337,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=2714MiB/s (2846MB/s), 2714MiB/s-2714MiB/s (2846MB/s-2846MB/s), io=26.5GiB (28.5GB), run=10011-10011msec