fio_test_res2_write/64_64k.txt
test: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=spdk, iodepth=64
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=73576: Thu Aug 14 19:53:03 2025
  write: IOPS=42.8k, BW=2677MiB/s (2807MB/s)(26.2GiB/10003msec); 0 zone resets
    slat (nsec): min=696, max=546732, avg=2611.52, stdev=1288.47
    clat (usec): min=24, max=6263, avg=1490.70, stdev=1141.14
     lat (usec): min=25, max=6264, avg=1493.31, stdev=1141.14
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   55], 10.00th=[  103], 20.00th=[  202],
     | 30.00th=[  420], 40.00th=[  914], 50.00th=[ 1434], 60.00th=[ 1975],
     | 70.00th=[ 2409], 80.00th=[ 2671], 90.00th=[ 2999], 95.00th=[ 3228],
     | 99.00th=[ 3621], 99.50th=[ 3785], 99.90th=[ 4293], 99.95th=[ 4490],
     | 99.99th=[ 5145]
   bw (  MiB/s): min= 2483, max= 2819, per=100.00%, avg=2677.81, stdev=87.97, samples=20
   iops        : min=39742, max=45112, avg=42844.90, stdev=1407.54, samples=20
  lat (usec)   : 50=3.93%, 100=5.80%, 250=13.53%, 500=8.86%, 750=4.88%
  lat (usec)   : 1000=4.70%
  lat (msec)   : 2=18.82%, 4=39.26%, 10=0.23%
  cpu          : usr=99.97%, sys=0.01%, ctx=11, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,428449,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=2677MiB/s (2807MB/s), 2677MiB/s-2677MiB/s (2807MB/s-2807MB/s), io=26.2GiB (28.1GB), run=10003-10003msec